import {
  ScrollView,
  StyleSheet,
  Text,
  View,
  Dimensions,
  ImageBackground,
  Image,
} from "react-native";
import React from "react";
import { Fontisto } from "@expo/vector-icons";
const windowWidth = Dimensions.get("window").width;
const windowHeight = Dimensions.get("window").height;
const Page11 = () => {
  return (
    <ScrollView
      style={{ width: windowWidth }}
      showsVerticalScrollIndicator={false}
    >
      <ImageBackground
        source={require("../../../assets/mag1/delgermend.jpeg")}
        style={{
          width: windowWidth,
          height: windowHeight,
          flex: 1,
        }}
        resizeMode="cover"
      >
        <View style={{ alignSelf: "flex-end", marginRight: 20, flex: 1 }}>
          <Text
            style={{
              color: "white",
              fontFamily: "Montserrat-medium",
              marginTop: 50,
            }}
          >
            Сэтгэл зүйч
          </Text>
          <Text
            style={{
              color: "white",
              fontFamily: "Montserrat-bold",
            }}
          >
            Ц.ДЭЛГЭРМЭНД
          </Text>
        </View>
        <View
          style={{
            flex: 1.5,
            alignSelf: "flex-end",
            marginRight: 20,
          }}
        >
          <Text
            style={{
              fontFamily: "Oswald-bold",
              color: "white",
              fontSize: 30,
              textAlign: "right",
              width: windowWidth / 2.2,
            }}
          >
            Ажилтан бүрийнхээ ажлаа хийдэг шалтгааныг сонирхоорой
          </Text>
        </View>
        <View
          style={{
            flex: 2.5,
            alignSelf: "flex-end",
            marginRight: 20,
          }}
        >
          <Text
            style={{
              fontFamily: "Cambria-italic",
              color: "white",
              fontSize: 20,
              textAlign: "right",
              width: windowWidth / 2,
            }}
          >
            Ажлын байрны сэтгэл зүй хэмээх ойлголт сүүлийн үед чухлаар тавигдах
            болсон. Хүн ажлаа хэрхэн сэтгэл хангалуун, үр бүтээлтэй, бухимдал
            багатай атлаа гүйцэтгэл сайтай хийх вэ гэдэг нь амьдралын маш чухал
            хэсэг болоод байгаа энэ үед бид сэтгэлзүйч Ц.Дэлгэрмэндийн зөвлөгөөг
            хүргэхээр бэлтгэлээ.
          </Text>
        </View>
      </ImageBackground>
      <View style={{ width: windowWidth / 1.1, alignSelf: "center" }}>
        <View
          style={{
            flexDirection: "row",
            justifyContent: "space-between",
            marginVertical: 10,
          }}
        >
          <View style={{ flexDirection: "row" }}>
            <Text style={{ fontWeight: "bold", color: "black" }}>54-56 | </Text>
            <Text style={{ color: "grey", fontWeight: "200" }}>
              CAREER DEVELOPER
            </Text>
          </View>
        </View>
        <View style={{ borderWidth: 1, borderColor: "grey" }} />
        <View
          style={{
            flexDirection: "row",
            width: windowWidth / 1.1,
            flex: 1,
          }}
        >
          <Text
            style={{
              fontSize: 50,
              fontFamily: "Playfair-regular",
              bottom: 10,
              flex: 0.1,
            }}
          >
            Ц
          </Text>
          <Text
            style={{
              fontSize: 16,
              fontFamily: "Montserrat-bold",
              flex: 0.9,
              top: 10,
              marginLeft: 10,
            }}
          >
            ар тахалтай холбоотойгоор ажлын байрны халшрах хам шинжийн
          </Text>
        </View>
        <Text
          style={{ fontSize: 16, fontFamily: "Montserrat-bold", bottom: 20 }}
        >
          талаар яригдах болжээ. Үүнээс өмнө хүн өмнөх ажлаа үг дуугүй л хийх
          ёстой гэсэн ойлголт зонхилж байсан мэт. Ажлын байранд сэтгэл зүй
          яагаад чухал байдаг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Халшрал хэмээх өвчлөл нь зөвхөн ажлын байран дээр бий болдоггүй. Өдөр
          тутмын амьдралд ч тохиолдох боломжтой. Тиймээс цар тахлаас өмнө ажлаас
          халшрах өвчлөлөөр олон хүн өвчилж байгааг дэлхий даяар сэтгэл
          судлаачид анхааруулдаг байсан. Харин цар тахлын үед хүмүүс ажлаас
          халшрах өвчлөл, түүний сөрөг талуудыг илүү сайн ойлгож, анзаарах
          болсон.
        </Text>
        <Text style={styles.textStatus}>
          Хүний ажиллаж, амьдарч байгаа бүхий л орчинд сэтгэл санааны байдал
          тогтвортой байх эсэх нь хамгийн чухал. Сэтгэл санааны хувьд тогтвортой
          байгаа хүн ажлын байран дээр илүү бүтээмж өндөртэй, гэр бүлдээ илүү
          амгалан тайван байх боломжтой. Хэдийгээр энгийн мэт боловч сэтгэл
          санаа нь тогтворгүй, ажлаас халширсан байгаа хүмүүсийн ачааллыг нь
          бууруулж, өөртөө анхаарал хандуулах цаг хугацаа олгохын оронд тэднийг
          ганцаараа асуудлаа шийдвэрлэж дуусахыг нь “хүлээдэг”. Энэ хугацаанд
          ажлаас халширсан хүн ихэвчлэн сэтгэл санааны хувьд улам хүнд байдалд
          орсоор байдаг.
        </Text>
        <Text style={styles.textTitle}>
          Хүн ажлаасаа халширвал өөрийгөө хэрхэн удирдан залах талаар зөвлөхгүй
          юу?
        </Text>
        <Text style={styles.textStatus}>
          Ажлаас халширч буй шинж тэмдгийг эхлээд анзаарах хэрэгтэй. Өглөө
          босоод хийх ажлуудаа бодохоор сэтгэл хөдлөл биш, сэтгэл өвдөлт мэдрэх,
          бүх зүйл том асуудал мэт санагдах, ажлаа хичээл зүтгэл гаргаж хийсэн ч
          хамгийн бага гүйцэтгэлтэй байх, байнга өвчлөх, байнгын уур бухимдал,
          түгшүүртэй байх зэрэг шинж тэмдэг танд хэдэн долоо хоногоос эхлэн
          хэдэн сараар үргэлжилж байгаа бол Та ажлаас халшрах өвчлөлд өртсөн
          байх эрсдэлтэй.
        </Text>
        <Text style={styles.textStatus}>
          Энэ тохиолдолд өөрт байгаа ажилтай холбоотой айдас, харамсал, өөртөө
          итгэлгүй байдал, хүний хэлсэн үг, өөрийгөө буруутгах, зэрэг сэтгэл
          хөдлөлүүдийг ажиглаж, анзаарах хэрэгтэй. Ажлаас халшрах болсон
          шалтгаан нь
        </Text>
        <Text
          style={[styles.textStatus, { marginLeft: 20, marginVertical: 5 }]}
        >
          • Таны ажлын ачаалал байж болно
        </Text>
        <Text
          style={[styles.textStatus, { marginLeft: 20, marginVertical: 5 }]}
        >
          • Хамт олны харилцаа байж болно
        </Text>
        <Text
          style={[styles.textStatus, { marginLeft: 20, marginVertical: 5 }]}
        >
          • Эсвэл та дараагийн ажилдаа шилжин ажиллахад бэлэн болсон байж болох
          юм.
        </Text>
        <Text style={styles.textStatus}>
          Аль ч шалтгаан байсан ажлаасаа гарах шийдвэрийг гаргахад хүндрэл
          үүсгэдэг сэтгэл хөдлөл байдаг. Тэгэхээр эхлээд өөрийн сэтгэл
          хөдлөлүүд, түүний цаана байгаа учир шалтгаантай танилцах хэрэгтэй.
          Яагаад өөртөө хэрэгтэй шийд­вэрийг гаргаж чадахгүй байгаа шалтгаанаа
          ойлгосон үед танд дараагийн зорилго хэрэгтэй. Юуны төлөө ажиллаж,
          хөдөлмөрлөх вэ, юуг хийчихсэн байвал таны сэтгэлд аз жаргал авчрах вэ
          гэдэг шинэ зорилгоо олж чадвал Та халшралаас өөрийгөө эмчилж чадлаа
          гэсэн үг юм.
        </Text>
        <Text
          style={{
            fontFamily: "Cambria-bold-italic",
            fontSize: 25,
            color: "#0066a6",
          }}
        >
          Юуны төлөө ажиллаж, хөдөлмөрлөх вэ, юуг хийчихсэн байвал таны сэтгэлд
          аз жаргал авчрах вэ гэдэг шинэ зорилгоо олж чадвал Та халшралаас
          өөрийгөө эмчилж чадлаа гэсэн үг юм.
        </Text>
        <Text style={[styles.textTitle, { marginTop: 15 }]}>
          Таны ажигласнаар ажилчид болон удирдлагууд сэтгэл зүйн талаас харахад
          юун дээр алдаа гаргадаг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Хүн бүр ажлаа олон шалтгаанаар хийдэг. Удирдлагууд ихэвчлэн
          ажилт­нуудаа өөртэйгөө адилхан шалтгаанаар ажиллаж байгаа гэж найддаг.
          Ажилтан болгон өөр өөр шалтгаанаар өглөө ажилдаа ирдэг. Удирдлагын
          хувьд ажилтан бүрийнхээ ажлаа хийдэг шалтгааныг нь сонирхож мэддэг
          байх хэрэгтэй. Хэрвээ ажилтанд ажилдаа ирэх шалтгаан үлдээгүй бол
          ятган үнэмшүүлж, ажлын байрандаа авч үлдэхээс илүүтэй, тэдний
          дараагийн карьерын төлөвлөгөөг нь ярилцан тодорхойлж өгч болох юм.
        </Text>
        <Text style={styles.textStatus}>
          Хэдийгээр ажиллах хүсэл сонирхол, ур чадвар өндөр байсан ч өдөр тутмын
          үйлдэл нь хүнийг ужиг ядаргаанд хүргэн, ажиллах эрч хүчийг бууруулдаг.
          Байнгын дутуу нойр, буруу хооллолт, хөдөлгөөнгүй байдал, согтууруулах
          ундааны хэрэглээ, гэр бүлийн таагүй харилцаа зэрэг нь ажлын байран
          дээр ужиг ядаргаанд хүргэх, цаашлаад ажлын байран дээрх халшрал бий
          болгох эрсдэлтэй.
        </Text>
        <Text style={styles.textTitle}>
          Өнөөдөр нэг хүн нэг ажлаа хийсээр насыг барах хандлага халагдаж,
          үндсэн ажлаасаа гадна өөр ажил хийх үзэгдэл түгээмэл болжээ. Энэ нь
          тухайн хүн олон янзын чадвартай болох, орлогоо нэмэгдүүлэх, туршлагаа
          зузаатгах зэрэг ач холбогдолтой. Гэвч нөгөө талд үүнтэй холбоотой
          сэтгэл зүйн дарамт үүсэж байдаг уу?
        </Text>
        <Text style={styles.textStatus}>
          Ийм төрлийн ажлын дарамт, ачаалал ихэвчлэн эрэгтэйчүүдэд хүнд тусдаг,
          илүүтэй ирдэг. Гэр бүлээ авч явах ёстой гэсэн соёлын онцлогоос
          шалтгаалан эрэгтэй хүмүүс цалингаасаа гадуур орлоготой байх, хэд хэдэн
          ажил зэрэг хийх, амралтын өдрөөр ажиллах, оройн цагаар суух зэргээр
          санхүүгийн орлогоо нэмэгдүүлдэг.
        </Text>
      </View>
      {/* page2 */}
      <View style={{ marginHorizontal: 20 }}>
        <View style={{ flexDirection: "row", flex: 1 }}>
          <Image
            source={require("../../../assets/mag1/delgermendhapy.jpeg")}
            style={{ width: 150, height: 150, borderRadius: 100, flex: 0.4 }}
          />
          <View style={{ flex: 0.6, justifyContent: "center" }}>
            <View style={{ borderWidth: 1, borderColor: "#0066a6" }} />
            <Text
              style={{
                marginHorizontal: 20,

                fontFamily: "Cambria-bold-italic",
                color: "#0066a6",
              }}
            >
              Залуучууд глобалчлагдсан, нэгдмэл дэлхий, томоохон зах зээлд ижил
              төстэй амьдралын хэв маяг бүрдүүлэн хил хязгаар үл хамааран
              ажиллаж, өрсөлдөхийг илүүд үзэж байна.
            </Text>
            <View style={{ borderWidth: 1, borderColor: "#0066a6" }} />
          </View>
        </View>
        <Text style={styles.textStatus}>
          Богино цаг хугацаанд томоохон зорилго тавих нь өөрт байгаа боломж
          бололцоог хамгийн өндөр үр дүнтэйгээр ашиглах шаардлага үүсгэдэг.
          Иймээс цаг хугацааны, санхүүгийн, хүн хоорондын харилцааны тал дээр
          яаралтай шийдвэрүүдийг гаргах хэрэгтэй юм. Өөрийн бие физиологи,
          сэтгэл санааг богино хугацаанд өндөр ачаалалтай ажиллуулах нь хамгийн
          сайн шийдэл байдаггүй. Түгшүүр, айдас, нойрны асуудал, уур бухимдал,
          чөлөөт цаг завгүй байх гээд олон сөрөг зүйлийг араасаа дагуулдгийг
          анхаарах хэрэгтэй.
        </Text>
        <Text style={styles.textTitle}>
          Олон улсад 18-40 насны хөдөлмөр эрхэлж байгаа залуусын сэтгэл зүйн
          онцлог хандлага юу байна вэ?
        </Text>
        <Text style={styles.textStatus}>
          Залуучуудын хувьд нэг улс орны ажил эрхлэх боломжинд зориулж сурч
          хөгжих гэхээсээ илүү глобалчлагдсан, нэгдмэл дэлхий, томоохон зах
          зээлд ижил төстэй амьдралын хэв маяг бүрдүүлэн хил хязгаар үл хамааран
          ажиллаж, өрсөлдөхийг илүүд үзэж байна.
        </Text>
        <Text style={styles.textStatus}>
          Тиймээс өөрийн ур чадвар, эрдэм мэдлэг, бусдад туслах боломжийг зөвхөн
          нэг улс орны хэрэгцээ шаардлагаар тодорхойлж харахаас илүүтэй улс
          дамнасан ажил хөдөлмөр, олон соёлын нэгдсэн баг хамт олнууд, дэлхий
          дахинд чухал хэрэгцээтэй асуудлыг хамтдаа шийдвэрлэн тодорхойлох
          зэргээр илүү том хүрээнд ирээдүйн ажлын байрыг тодорхойлох болсон.
        </Text>
        <Text style={styles.textTitle}>
          Цар тахалтай холбоотойгоор хөдөлмөрийн зах зээлд өөрчлөлт гарч байна.
          Хүн заавал оффист очиж ажиллах шаардлагагүй, гэрээсээ болон зайнаас
          ажиллах боломжтой гэдгийг ажил олгогч болон ажилтан ойлгодог болсон.
          Үүний сул болон давуу талыг та хэрхэн харж байна вэ?
        </Text>
        <Text style={styles.textStatus}>
          Дэлхий даяараа гэрээсээ болон оффисоос ажиллах чадварт эрчимтэй
          суралцлаа. Цар тахлын өмнө бүх төрлийн ажлын байрууд оффисын өрөөнд
          байх хэрэгтэй гэсэн нэгдмэл хандлагатай байсан. Харин одоо ажлын
          онцлогоос шалтгаалан оффис, гэрийн орчныг хоршин ашиглах нь тодорхой
          болж байна.
        </Text>
        <Text style={styles.textStatus}>
          Цар тахлын үеэр гэрээсээ ажиллаж эхэлсэнтэй холбоотой ажилтнууд амрах,
          ажиллах, гэр бүлдээ зарцуулах цагийг өөрсдөө удирдах болсон. Ингэснээр
          амрах цагтаа амрахгүй хэтрүүлэн ажиллах, олон нийтийн харилцааны
          дутагдалд орох, зорилгын мэдрэмж алдагдах зэрэг сул талууд гарч ирсэн.
          Эсрэгээрээ мөн олон давуу талууд бий болсон. Тухайлбал, хүмүүс гэрийн
          тухтай орчиндоо сууж ажиллах боломжтой болсон, хүн бүр гэртээ ажлын
          орчноо тохижуулж амжсан байх. Мөн түгжрэлд цаг үрэх шаардлагагүй олон
          хурал уулзалтуудыг зохион байгуулж болохыг харлаа. Хамгийн чухал нь
          гэр бүлээрээ оройн хоолоо хамтдаа сууж идэх боломж түлхүү бий болсон.
        </Text>
        <Text style={styles.textStatus}>
          Цар тахлын эхэнд үед ажилдаа түлхүү цаг хугацаагаа зориулж байсан
          ажилтнууд ч ажил амьдралын тэнцвэртэй байдалд өөрийн цаг хугацааг
          хуваарилж чаддаг болж байгаа нь маш том эерэг хандлага.
        </Text>
        <Text style={styles.textTitle}>
          Карьерынхаа туршид олон ажил эрхэлж байсан, ажлаа олон сольдог
          хүмүүсийг Монголд бүтэл муутай гэж харах хандлагатай байдаг. Харин
          олон улсад туршлагатай, амбицтай боловсон хүчин гэж үздэг.
          Монголчуудын хувьд ойлголт нь яагаад өөр байдаг вэ? Үүн дээр та ямар
          бодолтой байна вэ? Энэ нь зөв хандлага уу?
        </Text>
        <Text style={styles.textStatus}>
          Энэ нь зөвхөн монголчуудын дунд гэхээсээ илүү Азийн соёлд түлхүү
          анзаарагддаг. Нэг байгууллагадаа удаан хугацаагаар ажиллах нь ажилтны
          үнэ цэнийг нэмэгдүүлж байдаг. Урт эсвэл богино хугацаанд ажиллах нь
          орчин үед чухал бус, харин ямар хэмжээний ажлуудыг хийж бүтээсэн гэдэг
          нэгтгэсэн ажлын туршлага нь илүү чухал болж байна. Үнэнч тууштай
          ажилтан хайж буй байгууллага бий, мөн богино хугацааны төслийг
          хариуцаж ажиллах менежер хайж буй байгууллага ч бий. Тиймээс ажлын
          байрын онцлог, хийх хэрэгтэй ажлын нөхцөлөөс шалтгаалан өөр өөр ур
          чадвар бүхий хүмүүсийг ажлын байранд цуглуулах хэрэгтэй болсоор байх
          болно. Тиймээс зөв буруу гэхээсээ илүүтэй тухайн шаардлагад зохицоод
          явж болох нь.
        </Text>
      </View>
    </ScrollView>
  );
};

export default Page11;

const styles = StyleSheet.create({
  textTitle: {
    fontSize: 18,
    fontFamily: "Montserrat-bold",
    // marginBottom: 15
  },
  textStatus: {
    fontSize: 16,
    marginVertical: 15,
    fontFamily: "Montserrat-regular",
  },
});
