import {
  StyleSheet,
  Text,
  View,
  ScrollView,
  ImageBackground,
  Dimensions,
  Image,
} from "react-native";
import React from "react";
const windowWidth = Dimensions.get("window").width;
const windowHeight = Dimensions.get("window").height;
import { useNavigation } from "@react-navigation/native";
import { AntDesign } from "@expo/vector-icons";

const Page5 = () => {
  const navigation = useNavigation();
  return (
    <ScrollView style={{ flex: 1 }} showsVerticalScrollIndicator={false}>
      {/* Bayarsaihanii zurag */}
      <ImageBackground
        style={{ width: windowWidth, height: windowHeight }}
        resizeMode="cover"
        source={require("../../../assets/mag1/bolorerdenep1.jpg")}
      >
        <AntDesign
          name="arrowleft"
          size={30}
          color="black"
          style={{
            position: "absolute",
            top: 50,
            left: 20,
            zIndex: 2,
          }}
          onPress={() => navigation.goBack()}
        />
        <View
          style={{
            backgroundColor: "#f15623",
            marginTop: 70,
            padding: 15,
            justifyContent: "flex-end",
            alignSelf: "flex-end",
          }}
        >
          <Text
            style={{
              fontFamily: "Montserrat-bold",
              textAlign: "right",
              fontSize: 16,
              color: "white",
            }}
          >
            МАНЛАЙЛАГЧ
          </Text>
        </View>
      </ImageBackground>
      <View
        style={{ width: windowWidth / 1.1, alignSelf: "center", marginTop: 15 }}
      >
        {/* Header Page and text */}
        <View style={{ flexDirection: "row", justifyContent: "space-between" }}>
          <View style={{ flexDirection: "row" }}>
            <Text style={{ fontWeight: "bold" }}>21-25 | </Text>
            <Text style={{ color: "grey", fontWeight: "200" }}>
              CAREER DEVELOPER
            </Text>
          </View>
          <View>
            <Text
              style={{
                fontFamily: "Montserrat-bold",
                color: "#f15623",
                fontSize: 10,
              }}
            >
              МАНЛАЙЛАГЧ
            </Text>
          </View>
        </View>
        {/* Zurraas  */}
        <View
          style={{
            borderWidth: 1,
            marginVertical: 10,
          }}
        />
        {/* Taniltsuulga */}
        <Text
          style={{
            marginTop: 50,
            textAlign: "center",
            fontSize: 14,
            fontFamily: "Montserrat-medium",
          }}
        >
          Харилцаа холбоо, мэдээллийн технологийн газрын дарга
        </Text>
        <Text
          style={{
            color: "#f15623",
            textAlign: "center",
            fontSize: 25,
            fontFamily: "Montserrat-bold",
          }}
        >
          Б.БОЛОР-ЭРДЭНЭ
        </Text>
        <Text
          style={{
            fontWeight: "bold",
            fontSize: 30,
            textAlign: "center",
            marginVertical: 20,
            fontFamily: "Playfair-bold",
          }}
        >
          ЧАДВАРЛАГ ЗАЛУУС ОЛОН УЛСАД ХҮЧ СОРИОСОЙ ГЭЖ ХҮСДЭГ
        </Text>
        <View
          style={{
            borderWidth: 1,
            backgroundColor: "#f15623",
            borderColor: "#f15623",
            padding: 2,
            width: 80,
            alignSelf: "center",
            marginVertical: 20,
            marginBottom: 30,
          }}
        />

        <View
          style={{
            flexDirection: "row",
            width: windowWidth / 1.1,
          }}
        >
          <Text
            style={{ fontSize: 50, fontFamily: "Playfair-regular", bottom: 10 }}
          >
            Б
          </Text>
          <Text
            style={{
              fontSize: 20,
              fontFamily: "Montserrat-bold",
              marginHorizontal: 5,
            }}
          >
            идний урилгыг хүлээж авсанд баярлалаа. Ярилцлагаа таны өглөө хэрхэн
            эхэлдгээс эхэлье.
          </Text>
        </View>

        <Text style={styles.textStatus}>
          Миний ажил ихэвчлэн шөнө 1-2 цагийн үед дуусаад өглөө 08:30-д бэлэн
          байх шаардлагатай байдаг учраас өглөө яарч гардаг. Нүүрээ будаж,
          хувцсаа өмсөж гараад ажил дээрээ очиж кофегоо уудаг.
        </Text>

        <Text style={styles.textTitle}>
          Та өглөө орноосоо босохоосоо өмнө дуу сонсдог гэсэн. Энэ талаар
          дэлгэрүүлбэл?
        </Text>
        <Text style={styles.textStatus}>
          Тийм ээ. Энэ зуршил маань Оксфордын Их Сургуульд сурч байхад тогтсон.
          Завтай үедээ өглөөг тайван, цоглог хэмнэлтэй 1-2 дуу сонсож эхлүүлэх
          нь өдрөө эрч хүчтэй өнгөрөөхөд тусалдаг.
        </Text>
        <Text style={styles.textTitle}>
          Та шөнө хангалттай амарч чадаагүй хүний хувьд өглөөг эрч хүчтэй
          эхлүүлэхэд дуу хөгжим сонсох завгүй үед юу тусалдаг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Монголд ажиллахын нэг хэцүү тал нь урьдчилж төлөвлөөгүй хурал,
          уулзалт, яаралтай ажил гэнэт гарч ирэх тохиолдол олон байдаг. Энэ нь
          хуваарийн дагуу ажлаа явуулахад саад учруулдаг учир өглөө эрт чухал
          ажлуудаа хийхээр төлөвлөдөг. Урд орой нь маргаашийн ажлаа төлөвлөөд
          унтдаг учир өглөө тэднийгээ амжуулахаар яаран сэрдэг. Өөрөөр хэлбэл
          үүрэг хариуцлага маань намайг өглөө эрч хүчтэйгээр босоход нөлөөлдөг
          дөө.
        </Text>
        <Text style={styles.textTitle}>
          Та Оксфордод хоёр удаа өргөдөл өгч 100 хувийн тэтгэлэг авч байсан
          гэсэн. Хэдийгээр эхний удаа гэр бүлийн байдлаас болж сургуульдаа явж
          чадаагүй ч гэсэн бууж өгөхгүйгээр хоёр дахь удаагаа оролдлого хийнэ
          гэдэг мятаршгүй, тууштай зангийн үлгэрлэл болов уу. Энэ төрмөл зан
          уу?, эсвэл хичээл зүтгэлийн үр дүн үү?
        </Text>
        <Text style={styles.textStatus}>
          Би багадаа их эрх хүүхэд байсан. Гэхдээ хичээлдээ дуртай учраас
          суралцахад хэдэн ч цаг зарцуулсан шантардаггүй байлаа. Оксфорд бол
          миний багын мөрөөдөл учраас бусад их сургуулийн тэтгэлэгүүдээс
          татгалзаж нэг жил өнжсөн. Эхний жилийн 100 хувийн тэтгэлгээс татгалзаж
          дараа жил дахин өргөдөл өгөөд тэнцэх магадлал маш бага шүү дээ. Чин
          үнэнийг хэлэхэд тэр хугацаанд маш их сэтгэлээр унаж, стрессдэж байсан.
          Гэхдээ би тэр зүйлийг чин сэтгэлээсээ хүсэж байгаагаа мэдсэн учраас
          түүнийхээ төлөө тууштай хөдөлмөрлөсөн.
        </Text>
        <Image
          source={require("../../../assets/mag1/bolor1.png")}
          style={{ height: 250, width: windowWidth / 1.1 }}
        />
        <Text
          style={{
            // textAlign: "center",
            fontFamily: "Montserrat-medium",
            backgroundColor: "#f15623",
            color: "white",
            paddingVertical: 15,
          }}
        >
          "Үүрэг хариуцлага маань намайг өглөө эрч хүчтэйгээр босоход
          нөлөөлдөг."
        </Text>

        <Text style={styles.textTitle}>
          Танд урам зориг авдаг олны танил хүн байгаа юу?
        </Text>
        <Text style={styles.textStatus}>
          Би олон төрлийн хүнээс янз бүрийн авууштай чанарыг авч суралцахыг
          хичээдэг. Сүүлд комедиан Кевин Хартын намтарчилсан киног үзсэн. Бидний
          өмнө зүгээр л хошин яриатай марзан залуу харагддаг боловч ямар их
          хөдөлмөр, эрч хүч, энергийг зарцуулж байж одоо байгаа ажилтанд хүрсэн
          гэдгийг ойлгосон. Монголоос ч гэсэн урам зориг авдаг хүн маш олон
          байгаа.
        </Text>

        <Text style={styles.textTitle}>
          Таны хувьд анх 2019 онд “И-Монголиа” төслийг хэрэгжүүлэхээр шийдэхдээ
          өөрийн санаачилгаар Засгийн газрын Хэрэг эрхлэх газар орж төслөө
          танилцуулсан гэж сонссон. Энэ нь залуу хүний хувьд том зориг, сорилт
          байх. Тэгэхээр амжилттай алхам хийхэд зориг дутаж байгаа тэрхүү
          залууст хандаж юу гэж хэлэх вэ?
        </Text>
        <Text style={styles.textStatus}>
          Оксфордод өргөдөл өгөхөөр бэлдэж байх үедээ тэр сургуулийн олон
          профессорын номыг уншаад тэдэнрүү е-мейлээр номыг нь уншиж, сэтгэгдлээ
          илгээдэг байсан. Тэрний ачаар маш олон хүмүүсээс хэрэгтэй зөвлөгөөгөө
          авсан нь надад их тус болсон. Ер нь их сургуульд сурахад ч ажлын
          талбар дээр ч шантармаар хүнд үе олон тохионо. Гэхдээ бууж өгөөгүй
          хүмүүс л түүх бичдэг. Ямар ч түүхэн ном, кино зохиолын гол дүр их
          үйлсийг бүтээж яваад бууж өгч дуусдаггүй шүү дээ. Залуусыг харахаар
          хэдий мундаг ч хичээж их ажиллаж байгаадаа гомдоллоод байгаа тал
          ажиглагддаг. Хүн өөрийгөө хараад маш их хөдөлмөрлөж байна гэж дүгнэх,
          хажууд байгаа хүмүүс чинь чамайг үнэхээр их хичээж ажиллаж байна гэж
          харах өөр ойлголтууд. Залуустаа зөвлөхөд, хэн нэгэнд харуулах гэж биш
          яг өөрийнхөө төлөө зорилгодоо хүрэх гэж бодитойгоор ажиллах ёстой.
          Яагаад болохгүй байгаагаа өөртэйгөө тулж ярилцаад олон зүйл
          бодохгүйгээр ажлын гүйцэтгэлдээ л анхаарах хэрэгтэй.
        </Text>

        <Image
          source={require("../../../assets/mag1/bolor2.png")}
          style={{ height: 250, width: windowWidth / 1.1 }}
        />
        <Text
          style={{
            // textAlign: "center",
            fontFamily: "Montserrat-bold",
            backgroundColor: "#f15623",
            paddingVertical: 15,
            fontSize: 16,
            color: "white",
          }}
        >
          “ӨӨРИЙГӨӨ БОДИТОЙГООР ҮНЭЛНЭ ГЭДЭГ ХУВь ХҮН, БАЙГУУЛЛАГА, УЛС
          ҮНДЭСТНИЙ ХУВьД АЛДААГАА ЗАСАХ МАШ ТОМ БОЛОМЖ.”
        </Text>

        <Text style={styles.textTitle}>
          Зорилгодоо хүрэхээр хөдөлмөрлөж байх явцдаа заавал хийх ёстой зүйл гэж
          байдаг шиг зайлсхийх ёстой зүйлийг нэрлэ гэвэл?
        </Text>
        <Text style={styles.textStatus}>
          Буруу хүмүүсээс зөвлөгөө авах. Надад төрд ажиллаж байгаагийн хувьд маш
          олон хүмүүс сайн санааны үүднээс ирж зөвлөгөө өгдөг. Гэхдээ эргээд
          харахад зарим хүмүүсийн зөвлөгөөг дагасан бол миний хийж буй ажлууд,
          “И-Монголиа” одоогийнх шиг явахгүй байх магадлалтай байсан. Ер нь өөрт
          чинь атаархдаг найз нөхөд, сөрөг бодолтой ах эгч нарын зөвлөгөөнөөс
          зайлсхийх хэрэгтэй.
        </Text>

        <Text style={styles.textTitle}>
          Таны амьдралд хамгийн их эргэлт хийсэн үйл явдал, том, жижиг алхам юу
          вэ?
        </Text>
        <Text style={styles.textStatus}>
          Оксфордод сурсан явдал байсан. Одоо үед хаанаас ч дэлхийн шилдэг их
          сургуулиудын хичээлийг цахимаар үзэх боломжтой. Харин тэдгээр
          сургуулийн бидэнд санал болгодог зүйл бол тухайн орчинд хүрээллээ
          тэлж, дэлхийн өнцөг булан бүрээс ирсэн залуусаас суралцах, эрдэмтэн,
          профессоруудын соёлоос суралцах байдаг. Мэдээж анх очиход яриа бүрийн
          ард явж байдаг онолуудыг ойлгохгүйдээ сэтгэлээр унаж номын санд олон
          хоногийг өнгөрөөх, шантарч буцмаар санагдах үе зөндөө. Тийм учраас
          амжилтын ард чимээгүй нуугдах маш их стресс шаргуу хөдөлмөр,
          бэрхшээлтэй замыг туулах сэтгэл зүйн бэлтгэлтэй байх хэрэгтэй.
        </Text>
        <Text style={styles.textTitle}>
          Та гэр бүлдээ хэр их цаг зарцуулдаг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Одоо бол бага. Манай гэр бүл миний зорилгыг маш сайн дэмждэг учраас
          харьцангуй намайг ойлгодог. Би 2022 онд гэр бүлдээ их цаг зарцуулах
          зорилго тавьсан.
        </Text>
        <Text style={styles.textTitle}>
          Аав, ээж тань төрийн хүмүүс байдаг гэж сонссон?
        </Text>
        <Text style={styles.textStatus}>
          Тийм. Манай аав агентлагт дарга хийдэг. Ээж маань их сургуульд
          хуульчаар ажилладаг.
        </Text>
        <Text style={styles.textTitle}>
          Төрийн албанд зүтгэх нь таны тухайн үеийн нөхцөл байдалд гаргасан
          шийдвэр байсан уу? Аль эрт төлөвлөчихсөн зорилго байсан уу?
        </Text>
        <Text style={styles.textStatus}>
          Төрд ажиллах гэдэг огт бодож байгаагүй шийдвэр байсан.(инээв) Гэхдээ
          төрд орсноор тодорхой зүйлийг маш хурдтай шийдэх боломжтой. Магадгүй
          “И-Монголиа”-г хувийн хэвшил хийсэн бол ийм хурдан тодорхой ахиц
          гаргахгүй байсан байх. Бид төрийн үйлчилгээг гаднаас хараад
          шүүмжлэхээс илүү тодорхой хувь нэмрээ оруулах нь илүү үр дүнтэй. Миний
          хувьд “Төр цахимжихгүй бол ямар ч хувийн хэвшил цахим бизнес хийх
          боломжгүй” гэдэг дүгнэлт гаргасан судалгааны багт байсан. Тэгээд
          энэхүү ажлыг хэрэгжүүлэхээр төрд орохоор сэтгэл шулуудсан.
        </Text>
        <Image
          source={require("../../../assets/mag1/bolor3.png")}
          style={{ width: windowWidth / 1.1, height: 200 }}
        />
        <Text style={styles.textTitle}>
          Та таалагдахгүй орчинд, хүсээгүй зүйлээ хийх нь ямар ч сэтгэл ханамж
          өгдөггүй тул өөрийнхөө сонголтоор явахын тулд их зөрүүдэлдэг төрлийн
          хүн шиг санагдсан?
        </Text>
        <Text style={styles.textStatus}>
          Би их зөрүүд хүн. (инээв) Би арван жилээ 14-тэй, их сургуулиа 18-тай
          төгссөн. Одоогоор 10 гаруй жилийн ажлын туршлагатай. Солонгост сурч
          байхдаа Азийн хөгжлийн банканд, Оксфордод сурч байхдаа Дэлхийн банканд
          ажиллаж байсан. Хэзээ ч сурч байна гээд бүтэн цаг зарцуулж байгаагүй.
          Энэ олон жилийн сурсан зүйл, ажлын туршлага маань өнөөдрийн намайг
          бүтээж, хийж буй зүйлдээ тодорхой хэмжээний амжилт гаргахад нөлөөлсөн.
          Залуучуудад хэлэхэд маш сайн ажлын туршлагатай бол, сайн даргатай бол,
          маш их ажил гэж хэлмээр байна. Сайн хүрээлэл, ажлын туршлагатай болж
          байж өөрийнхөө хийхийг хүссэн бизнес, төслийг эхлүүлэх нь хамгийн үр
          дүнтэй байдаг.
        </Text>
        <Text style={styles.textTitle}>
          Та хоббидоо хэр их цаг зарцуулдаг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Надад байдаг ганц том хобби бол аялах. Гэхдээ одоогийн нөхцөлд аялалд
          гаргах цаг, боломж байхгүй байна. Харин ядарч, стрессдэхгүйн тулд
          дасгал хөдөлгөөнд заавал цаг гаргадаг.
        </Text>
        <Text style={styles.textTitle}>
          Миний сонссоноор та 30 гаруй орноор аялсан гэсэн. Аяллаас төрдөг
          мэдрэмж болон залууст заавал аялаарай гэж зөвлөх газар?
        </Text>
        <Text style={styles.textStatus}>
          Аяллаар явахдаа зөвхөн хөтөлбөрийн дагуу биш илүү сониуч тухайн газар
          амьдардаг хүмүүстэй ярьж үзэх, тухайн орны соёлыг сурах мэтийг
          хэрэгжүүлэх нь маш чухал. Америкийн тэрбумтан, нэг жижиг орны ядруухан
          амьдралтай хүн хоёулаа л өөрсдийн гэсэн туршлагатай, амьдралыг харах
          өнцөгтэй байдаг. Аяллаар яваад ирэхэд өмнө стрессдэж байсан асуудал
          жижиг болоод тайвшраад, аливааг томоор хардаг болдог. Мэдээж Парис гэх
          мэт хүн бүрийн очихыг хүсдэг улсруу аялахаас гадна Монголтой эдийн
          засаг, хөгжлөөрөө төстэй улсруу аялах нь гоё сонголт байх болно гэж
          хэлмээр байна.
        </Text>
        <Text style={styles.textTitle}>
          Залуучуудын хувьд Монгол болон олон улсын аль талбарт амжилт гаргахад
          боломж өндөр байна вэ?
        </Text>
        <Text style={styles.textStatus}>
          Аль ч талбарт том боломж байгаа гэхдээ би чадварлаг залуучуудыг олон
          улсад хүч сориосой гэж хүсдэг. Монголын нэг онцлог нь финтек,
          технологи суурьтай бизнесүүд дээр эдийн засгийн урсгал боломжийг өөрөө
          бий болгож орохоос өөр аргагүй. Харин олон улсад зорилгодоо үнэнч, нэг
          хүсэл тэмүүлэлтэй компаниуд хамтарч ажиллавал илүү боломжтой. Ялангуяа
          технологийн компаниудын хувьд гэрэлтэй ирээдүй байна. Тэднийг гаднын
          хөрөнгө оруулагчдад холбож өгөх нь бидний ажил учраас хамтарсан
          уулзалтуудыг маш олныг зохион байгуулдаг. Саяхан хэд хэдэн IT-гийн
          компаниуд “Дубай Экспо”-д оролцож дэлхийн хаана явж байгаагаа бодитоор
          харсан. Өөрийгөө бодитойгоор үнэлнэ гэдэг хувь хүн, байгууллага, улс
          үндэстний хувьд алдаагаа засах маш том боломж. Бид гаднын хүмүүст яаж
          харагдаж ойлгогддог гэдгийг мэдэх нь шинээр гарч ирж буй амжилттай
          яваа компаниудаа таниулахдаа юун дээр анхаарах вэ гэдгээ гаргаж ирэхэд
          чухал үзүүлэлт болно.
        </Text>
        <Text style={styles.textTitle}>
          Тантай санал нэг байна. Одоогоор бодитоор та бүхэнтэй хамтраад дэлхийн
          зах зээл дээр гарахаар явж байгаа компани бий юу?
        </Text>
        <Text style={styles.textStatus}>
          Одоогоор бид таван компанийг гаднын хөрөнгө оруулагчтай нь холбож
          өгсөн төдийгүй МУ-ын ЗГ-аас дэмжиж, батлан даах байдлаар нөлөө
          үзүүлсэн. Үүнээс гадна компаниудын хувьд харилцагчийнхаа итгэлийг дааж
          ажлаа мэргэжлийн, чадварлаг гүйцэтгэхэд анхаарах нь маш чухал.
        </Text>
        <Image
          source={require("../../../assets/mag1/bolor4.jpg")}
          style={{ width: windowWidth / 1.1, height: 200 }}
        />
        <Text
          style={{
            fontFamily: "Montserrat-bold",
            color: "#f15623",
            fontSize: 20,
            textAlign: "center",
            marginBottom: 15,
          }}
        >
          "чин сэтгэлээсээ хүсэж буйгаа мэдсэн учраас түүнийхээ төлөө тууштай
          хөдөлмөрлөсөн."
        </Text>
        <Text style={styles.textTitle}>
          Аль ч салбарын хүнд харилцаа холбоо маш чухал. Та өөрийн харилцаа
          холбоогоо хэрхэн хадгалж, ямар зарчим баримталдаг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Тодорхой түвшинд хүрээд ирэхээр шинээр хүнтэй танилцахаас илүү нэгэнт
          танил болсон хүмүүстэй үүсгэсэн харилцаагаа хадгалж үлдэх нь маш
          чухал. Жишээлбэл, Баяр ёслолоор мэндчилгээ хүргэх, сардаа нэг удаа
          ажил, амьдралыг нь асууж зурвас явуулна гэх мэт. Энэ дээр чин
          сэтгэлээсээ санаа зовох нь маш чухал. Худлаа байж болохгүй.
        </Text>
        <Text style={styles.textTitle}>
          Та одоогийн мэдлэг чадвартай хүний өнцгөөс 20 настай өөртөө юу зөвлөх
          вэ?
        </Text>
        <Text style={styles.textStatus}>
          Миний хувьд амбицтай байсан болохоор их ажил хийх ёстой гээд мөн маш
          олон зорилго тавиад түүндээ хүрч чадахгүй байгаадаа маш их бухимддаг
          байсан. Тийм учраас аливаа зүйлд бухимдах нь юуг ч өөрчлөхгүй гэж л
          хэлье даа.
        </Text>
        <Image
          source={require("../../../assets/icon.png")}
          style={{
            width: 14,
            height: 14,
            bottom: 25,
            right: 45,
            alignSelf: "center",
          }}
        />
      </View>
      <Text
        style={{
          fontSize: 14,
          fontFamily: "Montserrat-bold",
          marginHorizontal: 20,
          marginVertical: 30,
          textAlign: "right",
        }}
      >
        2022/03 САР
      </Text>
    </ScrollView>
  );
};

export default Page5;

const styles = StyleSheet.create({
  textTitle: {
    fontSize: 18,
    fontFamily: "Montserrat-bold",
    // marginBottom: 15,
    marginVertical: 8,
  },
  textStatus: {
    fontSize: 16,
    fontFamily: "Montserrat-regular",
    marginVertical: 8,
  },
});
