import {
  StyleSheet,
  Text,
  View,
  ScrollView,
  ImageBackground,
  Dimensions,
  Image,
} from "react-native";
import React from "react";
const windowWidth = Dimensions.get("window").width;
const windowHeight = Dimensions.get("window").height;
import { useNavigation } from "@react-navigation/native";
import { AntDesign } from "@expo/vector-icons";

const Page3 = () => {
  const navigation = useNavigation();

  return (
    <ScrollView style={{ flex: 1 }} showsVerticalScrollIndicator={false}>
      {/* Bayarsaihanii zurag */}
      <ImageBackground
        style={{ width: windowWidth, height: windowHeight, flex: 1 }}
        resizeMode="cover"
        source={require("../../../assets/mag1/bayka.png")}
      >
        <AntDesign
          name="arrowleft"
          size={30}
          color="black"
          style={{
            position: "absolute",
            top: 50,
            left: 20,
            zIndex: 2,
          }}
          onPress={() => navigation.goBack()}
        />
        <View style={{ flex: 0.5 }} />
        <View
          style={{
            backgroundColor: "#fec214",
            // marginBottom: 0,
            flex: 0.3,
            paddingLeft: 20,
            alignSelf: "flex-start",
          }}
        >
          <Text
            style={{
              fontFamily: "Montserrat-bold",
              fontSize: 22,
              paddingTop: 20,
            }}
          >
            ОНЦЛОХ ЗОЧИН
          </Text>
          <View style={{ borderWidth: 3, marginVertical: 15, width: 50 }} />
          <Text
            style={{
              fontFamily: "Montserrat-medium",
              fontSize: 16,
              width: windowWidth / 1.7,
            }}
          >
            Өөрийгөө хөгжүүлж, дараагийн шатанд гаргах хүсэлтэй залууст туслах
            зорилгоор "TomYo Edtech" технологийн компанийг үүсгэн байгуулсан
            В.Баярсайхантай ярилцлаа.
          </Text>
        </View>
      </ImageBackground>
      <View
        style={{ width: windowWidth / 1.1, alignSelf: "center", marginTop: 15 }}
      >
        {/* Header Page and text */}
        <View style={{ flexDirection: "row", justifyContent: "space-between" }}>
          <View style={{ flexDirection: "row" }}>
            <Text style={{ fontWeight: "bold" }}>8-13 | </Text>
            <Text style={{ color: "grey", fontFamily: "Montserrat-regular" }}>
              CAREER DEVELOPER
            </Text>
          </View>
          <View>
            <Text
              style={{
                fontFamily: "Montserrat-bold",
                color: "#fec214",
                fontSize: 10,
              }}
            >
              ОНЦЛОХ ЗОЧИН
            </Text>
          </View>
        </View>
        {/* Zurraas  */}
        <View
          style={{
            borderWidth: 1,
            marginVertical: 10,
          }}
        />
        {/* Taniltsuulga */}
        <Text
          style={{
            marginTop: 50,
            textAlign: "center",
            fontSize: 14,
            fontFamily: "Montserrat-medium",
          }}
        >
          TomYo Edtech технологийн компанийг үүсгэн байгуулагч, захирал
        </Text>
        <Text
          style={{
            color: "#fec214",
            textAlign: "center",
            fontSize: 25,
            fontFamily: "Montserrat-bold",
          }}
        >
          В.БАЯРСАЙХАН
        </Text>
        <Text
          style={{
            fontWeight: "bold",
            fontSize: 35,
            textAlign: "center",
            marginVertical: 20,
            fontFamily: "MinionPro-black",
          }}
        >
          ЗАЛУУС ОЛДОЖ БУЙ БОЛОМЖОО ТУЛТАЛ АШИГЛААСАЙ
        </Text>
        <View
          style={{
            borderWidth: 1,
            backgroundColor: "#fec214",
            borderColor: "#fec214",
            padding: 2,
            width: 80,
            alignSelf: "center",
          }}
        />
        <Text
          style={{
            textAlign: "center",
            fontSize: 15,
            marginVertical: 50,
            color: "grey",
            fontFamily: "Montserrat-medium",
          }}
        >
          “ЭХЛЭЛ НЬ ХЭЗЭЭ Ч АМАРХАН БАЙХГҮЙ Ч ЗҮРХ СЭТГЭЛЭЭСЭЭ ХИЙХИЙГ ХҮСЭЖ
          БАЙГАА ЗОРИЛГООСОО ОГТХОН Ч НЯЦАЛГҮЙ, ШУУД Ш**” ГЭЖ ЗАЛУУСЫГ УРИАЛАХ
          ДУРТАЙ НЭГЭН ЭРХМИЙГ БИД ОНЦОЛЖ БАЙНА.
        </Text>
        <View
          style={{
            flexDirection: "row",
            width: windowWidth / 1.1,
          }}
        >
          <Text
            style={{ fontSize: 50, fontFamily: "Playfair-regular", bottom: 10 }}
          >
            З
          </Text>
          <Text
            style={{
              fontSize: 20,
              fontFamily: "Montserrat-bold",
              marginHorizontal: 6,
            }}
          >
            алуусыг ажлын байр, ажил олгогчтой холбох гүүр болсон
          </Text>
        </View>
        <Text
          style={{ fontSize: 20, fontFamily: "Montserrat-bold", bottom: 20 }}
        >
          BizNetwork.mn-ийг анх та үүсгэн байгуулж байсан гэдэг. Үүнийг үүсгэн
          байгуулах санаа танд хэрхэн төрсөн талаарх түүхээс ярилцлагаа
          эхлүүлье.
        </Text>
        <Text style={styles.textStatus}>
          Энэ санаа хэрхэн төрсөн нь их энгийн, мөртлөө гоё түүх байдаг.
          Тодруулбал, зүгээр л ажлын ширээн дээр байсан өдөр тутмын сонины
          өчүүхэн булангаас BizNetwork-ийг энэ чиглэлээр хөгжүүлэх санаа төрсөн
          гэж ойлгож болно.
        </Text>
        <Text style={styles.textStatus}>
          Турк улсаас Монголдоо ирээд удаагүй байхдаа байгуулсан “Single tone”
          нэртэй технологийн жижигхэн компанид маань нэг өдөр маркетинг,
          борлуулалтын чиглэлийн шинэ ажлын орон тоо шаардлагатай болсон тул
          тууштай хамтран ажиллах ажилтан хайж байлаа. Тухайн үед unegui.mn,
          Zarmedee зэрэг газруудаар ажлын зараа түгээсэн ч манайд ажиллах хүн
          тийм амархан олдоогүй. Нэг өдөр зүгээр л ажлаа хийж суух зуураа ширээн
          дээр маань байсан нэгэн өдөр тутмын сонины ард “Ажлын зар тавих хэсэг”
          байгааг олж хараад утсаар төлбөрийг асуутал нэлээд өндөр ханш хэлсэн
          юм. Гэтэл хэдхэн ажилтантай, гарааны жижигхэн компанийн маань хувьд
          тийм өндөр төлбөр төлж ажилтан авах тухай ганцхан удаагийн зар сонинд
          нийтлүүлнэ гэдэг боломжгүй зүйл байв. Үүнээс л жижигхэн компаниудад
          зориулсан платформ хийх хэрэгтэй юм байна гэсэн санаа төрсөн.
        </Text>
        <Text style={styles.textStatus}>
          Тухайн үед гадаад, дотоодод сургуулиа төгсөөд ажил хайж байгаа
          залуучууд олон байсны зэрэгцээ манайх шиг олон жижиг компани ажилтан
          хайж байвал тэр хэрэгцээг нь бид хангах ёстой гэсэн бодол төрсөн.
          Ингээд нэг талаас компаниуд хамгийн хямд үнээр, олон хүнд нээлттэй
          ажлын байрыг зарладаг. Нөгөө талаас хэрэглэгчдэд маш олон сонголт бий
          болгох байдлаар BizNetwork.mn-ийг хөгжүүлсэн юм.
        </Text>
        <Text style={styles.textStatus}>
          Өөрөөр хэлбэл, BizNetwork.mn-ээр дамжуулж, хэрэглэгчдэд сонин дээр
          хэвлэгддэг хэдхэн том компанийн зарыг бус, бүх төрлийн, маш олон
          компанийн зарыг харж, илүү оновчтой бөгөөд өргөн сонголт бий болгохыг
          зорьсон. Тэр маань ч биеллээ олсон.
        </Text>
        <Text style={[styles.textTitle]}>
          Гэхдээ үүсгэн байгуулаад удалгүй байхдаа та бизнесээ худалдаад АНУ-д
          сурахаар явсан. Яагаад тийм шийдвэр гаргах болсон юм бэ?
        </Text>
        <Text style={styles.textStatus}>
          Америкт сурах шийдвэрийг гаргах болсон шалтгаан одоогийн ТомYo-той
          шууд холбоотой.
        </Text>
        <Text style={styles.textStatus}>
          21 дүгээр зуунд амьдарч байгаа хүмүүс бид бусадтайгаа өрсөлдөхүйц
          байхын тулд байнга хөгжиж байх ёстой. Хэдийгээр би тэр үед Турк улсад
          их сургуулиа төгсчихсөн, эх орондоо ирээд өөрийн гэсэн бизнесээ
          эхлүүлээд байсан ч гэсэн надад тэрнээсээ илүү хөгжих боломж байхгүй
          байгааг анзаарсан. Нэг эргээд харахад би Single tone гэх жижигхэн
          компанитайгаа долоон жил болчихсон байсан. Өөрөөр хэлбэл, би Турк
          улсад суралцаад эх орондоо ирснээс хойш өөрийгөө нэмж огт
          хөгжүүлээгүй, хөгжүүлье гэсэн ч хаанаас эхлэхээ мэдэхгүй буюу бие
          даагаад сурч болох хичээл байхгүй байгааг ойлгосон.
        </Text>
        <Text style={styles.textStatus}>
          Үнэндээ надад маркетинг, борлуулалтын чиглэлээр ч болтугай сурч,
          өөрийгөө хөгжүүлээд дараагийн түвшинд гаргах хүсэл байсан ч сонголт
          байгаагүй. Тэр байдал намайг Америк руу явж суралцаад, дэлхийн
          томоохон компаниудад ажиллаж, туршлага хуримтлуулж, илүү их зүйлийг
          мэдэх ёстой гэсэн шийдэлд хүргэсэн. Ингээд л нэг өдөр барьж байсан
          утас, унаж байсан автомашинаас эхлээд BizNetwork-оо хүртэл худалдаж,
          бүгдийг нь сургалтын төлбөр болгоод, зөвхөн боловсролдоо хөрөнгө
          оруулалт хийхийн тулд АНУ-ыг зорьсон.
        </Text>
        <Text style={styles.textStatus}>
          Тийм сонголт хийсэндээ одоо ч сэтгэл хангалуун байдаг. Учир нь АНУ-д
          суралцаж байхдаа бидэнд ямар олон боломжууд байдгийг олж харсан.
          Тухайлбал, монгол залуус хүсэх л юм бол дэлхийн шилдэг их, дээд
          сургуулийн тэтгэлэг авч болохыг, дэлхийн шилдэг компаниудад ажиллана
          гэдэг холын мөрөөдөл огтхон ч биш гэдгийг мэдэж авсан.
        </Text>
        <Text style={styles.textStatus}>
          Тиймээс буцаж ирээд ТомYo аппликэйшнийг хийгээд мэргэжлийн болон
          хэлний олон төрлийн хичээлүүд болон гадаадад суралцаж төгссөн хүмүүс
          дараагийн үеийн залуустаа туслах боломжтой байдлаар хөгжүүлээд явж
          байна.
        </Text>
        <Image
          source={require("../../../assets/mag1/baykahappy.png")}
          style={{ height: 250, width: windowWidth / 1.1 }}
        />
        <Text
          style={{
            backgroundColor: "#fec214",
            textAlign: "center",
            fontFamily: "Montserrat-medium",
            paddingVertical: 10,
          }}
        >
          Америкт сурах шийдвэрийг гаргах болсон шалтгаан одоогийн ТомYo-той
          шууд холбоотой.
        </Text>
        <Text style={styles.textTitle}>
          Америк явж суралцсан нь таны амьдралд яг ямар өөрчлөлтийг авчирсан гэж
          та боддог вэ?
        </Text>
        <Text style={styles.textStatus}>
          Одоо үед “дэлхийн иргэн” гэх нэр томьёог хүмүүс ихээр ашиглах болсон.
          Яг үнэндээ дэлхийн иргэн гэдэг нь энгийн иргэнээс юугаараа ялгаатай
          байх вэ гэдгийг ч өөрсдөө сайн тодорхойлж чаддаггүй.
        </Text>
        <Text style={styles.textStatus}>
          АНУ явахаасаа өмнө, гадаадад боловсрол эзэмшиж Монголдоо ирээд
          амжилттайгаар бизнесээ эхлүүлээд ажиллаж буйдаа сэтгэл өндөр байсан би
          тэр үед зүгээр л Монголын иргэн байсан. Өөрөөр хэлбэл, биднийг
          амжилтад хүрэхэд, илүү сайн сайхан зүйлийг бүтээхэд дэлхий дээр тийм
          олон боломж байдгийг мэддэггүй, зөвхөн урдаа байгаа жижигхэн
          асуудалтай зууралдаж, түүнийгээ шийдвэрлэхээрээ өөрийгөө мундаг гэж
          бодоод л явдаг байсан. Гэтэл дэлхийн түвшинд сэтгэж, дэлхийн зах зээлд
          өрсөлдөж, нийгэмд болохгүй зүйлсийг өөрчлөх боломж хүн бүхэнд бий.
        </Text>
        <Text style={styles.textStatus}>
          Бид ганцхан олдох амьдралаа илүү ихийг бүтээх хязгааргүй боломжууд
          дунд өнгөрөөж байгааг би АНУ-д сурч байхдаа ойлгосон. Үүнийгээ бид
          дараагийн үе буюу залууст ойлгуулах ёстой.
        </Text>
        <Text style={styles.textStatus}>
          Харамсалтай нь манай залууст боломж нь байгаа ч чиглүүлж, зааж өгөх
          хүн байгаагүй. Тиймээс үүнийг TomYo-гоор дамжуулан заах сонирхол
          бидэнд байна.
        </Text>
        <Text style={styles.textTitle}>
          Тэгвэл TomYo стартапын алсын хараа, стратеги нь юу вэ?
        </Text>
        <Text style={styles.textStatus}>
          ТомYo анх аппликейшнээр эхэлсэн. Одоогоор манай аппликэйшнийг 300,000
          гаруй хүн ашиглаж, гадаад хэл сурахаас эхлээд маш олон төрлийн ур
          чадварыг эзэмшиж байна.
        </Text>
        <Text style={styles.textStatus}>
          Тухайлбал, эрүүл байх, мэргэжлүүдийг судлах, гоо сайхан, иог,
          маркетинг, дизайн гээд бүх төрлийн сургалтыг зөвхөн аппикэйшнээр
          дамжуулан авч байна.
        </Text>
        <Text style={styles.textStatus}>
          Бидний цаашдын алсын хараа бол ердөө л Монгол оюуныг дэлхийд хүргэх
          зорилготой. Учир нь TomYo-г үүсгэн байгуулсан залуучууд өөрсдөө
          дэлхийн шилдэг сургуулиуд болон мундаг компаниудад ажиллаж байсан буюу
          боломжийг олж харсан хүмүүс.
        </Text>
        <Text style={styles.textStatus}>
          Бид өөрсдийнхөө сурсан бүх боломжийг дараа, дараачийн үеийн монгол
          залуучууддаа олгоход чиглүүлж, дэлхийд гарахад нь туслах уриатай.
          Түүнийхээ хүрээнд ч аппликэйшнээсээ гадна өөр олон зүйл хийж байгаа.
        </Text>
        <Text style={styles.textStatus}>
          Заримаас нь дурдвал, хүүхдүүдийг багаас нь бэлдэх зорилготой 1,000
          хүүхэдтэй Ерөнхий боловсролын сургууль байгуулж байна. Мөн TomYo Kids
          club нэртэйгээр хичээлийн дараах хөтөлбөр нэвтрүүлж байгааг хэлэхэд
          таатай байна. Түүнээс гадна АНУ-ын хөрөнгө оруулалтаар Монгол залуусын
          хөгжүүлсэн TomYo гар утасны сургалтын технологио олон улсад гаргахаар
          ажиллаж байна.
        </Text>
        <Text style={styles.textStatus}>
          Монгол оюуныг дэлхийд хүргэх боломж нь бидэнд бий. Гол нь бид
          түүнийгээ ашиглаад дэлхийн хэмжээнд өрсөлдөх гүүрийг хэрхэн бий болгох
          вэ гэдэг нь чухал.
        </Text>
        <Text
          style={{
            backgroundColor: "#fec214",
            fontFamily: "Montserrat-bold",
            fontSize: 18,
            padding: 18,
          }}
        >
          БИД ТЕХНОЛОГИ АШИГЛАХГҮЙГЭЭР ХЭЛ СУРАХЫН ТУЛД ДОР ХАЯЖ 500,000 ТӨГРӨГ
          СУРГАЛТЫН ТӨВД ӨГНӨ. ҮҮНИЙГ ХЭРХЭН ИЛҮҮ АМАРХАН БӨГӨӨД ХЯМДХАН
          БАЙЛГАЖ, ЦАГ ХУГАЦААГ ХЭМНЭХ БОЛОМЖИЙГ БИДЭНД ТЕХНОЛОГИ ОЛГОЖ БАЙГАА.
        </Text>
        <Text style={styles.textTitle}>
          Дижитал шилжилт энтрепренерүүдэд ямар боломж олгож байгаа гэж та бодож
          байна вэ?
        </Text>
        <Text style={styles.textStatus}>
          Технологийн хамгийн гоё нь ямар нэгэн үйлчилгээг илүү хүртээмжтэй
          бөгөөд өртөг багатайгаар нийтэд хүргэж чаддагт оршдог.
        </Text>
        <Text style={styles.textStatus}>
          Лэнд.мн-ийг жишээ болгон ярихад, Монголд зээл авах гэх хэцүү процессыг
          хүн болгоны гарт нь, хамгийн хялбараар хүргэж болдгийг технологи
          ашиглан харуулсан.
        </Text>
        <Text style={styles.textStatus}>
          Өмнө нь Лэнд.мн-ийг 0 хэрэглэгчтэй байхад 200,000 хэрэглэгчтэй болтол
          нь бид хөгжүүлсэн. Энэ бол технологийг хэрхэн ашиглаж, ямар нэг
          салбарыг бүтээлчээр устгаж, шинэчлэх вэ гэдэг зүйлийг бодитоор
          харуулсан бас нэг өөр зүйл.
        </Text>
        <Text style={styles.textStatus}>
          Түүнийг дагаад банкны салбар бүхэлдээ шинэчлэгдэж, зээл авах процесс
          нь ч илүү хялбар болж байна.
        </Text>
        <Text style={styles.textStatus}>
          Мөн түүнтэй адилаар бид боловсролын салбарт технологийг нэвтрүүлж
          хөгжүүлнэ. Бид технологи ашиглахгүйгээр хэл сурахын тулд дор хаяж
          500,000 төгрөг сургалтын төвд өгнө. Үүнийг хэрхэн илүү амархан бөгөөд
          хямдхан байлгаж, цаг хугацааг хэмнэх боломжийг бидэнд технологи олгож
          байгаа.
        </Text>
        <Text style={styles.textStatus}>
          Тухайлбал, TomYo аппликейшн хэрэглэгч Ховд аймгийн охин Япон хэлний
          сургалтын маань эхний шатыг дуусгаад гишүүнчлэлийнхээ эрхийг дуусахаас
          өмнө хоёр дахь шат нь орж амжих эсэхийг асууж манайх руу залгасан. Энэ
          бол технологийн хүртээмжийн давуу тал.
        </Text>
        <Text style={styles.textStatus}>
          Хэрвээ технологи байгаагүй бол тэр охин магадгүй Япон хэл сурч
          чадахгүй байсан байх. Учир нь түүний амьдардаг суманд Япон хэлний
          сургалтын цогц төв хэзээ нээгдэх нь эргэлзээтэй шүү дээ.
        </Text>
        <Text style={styles.textStatus}>
          Дижитал шилжилт гэдэг нь хүн бүрд хүрч чадаж байгаа энэ зүйлийг л
          хэлээд байгаа ойлголт. Хүмүүст илүү олон сонголт бий болгож, ялгаатай
          байдлыг арилгаж чаддаг нь технологийн давуу тал. Тиймээс боломжуудыг
          ашиглах хэрэгтэй.
        </Text>
        <Text style={styles.textTitle}>
          Ажил хэрэгтээ баримталдаг гол зарчим тань юу вэ?
        </Text>
        <Text style={styles.textStatus}>
          Хийж буй ажлаасаа шалтгаалаад хүн бүрийн баримтлах зарчим байнга
          өөрчлөгддөг байх.
        </Text>
        <Text style={styles.textStatus}>
          Сүүлийн үед би залууст боломж олгох зарчмыг илүү баримталж байна.
          Дараагийн үеийн залуустаа боломж олгож, хэн нэгэнд итгэж сурахыг илүүд
          үзэж байна. Хэдийгээр надад өөрөө илүү сайн хийх туршлага байсан ч
          залуустаа итгээд өөрсдөө алдаж, оноод сурах боломжийг нь олгох нь
          чухал гэж боддог болсон.
        </Text>
        <Text style={styles.textStatus}>
          Бид өөрсдөө туг бариад залуусын урд алхах биш, тэднийг чиглүүлээд,
          замд нь саад болсон мөсийг хагалаад зогсож байх ёстой гэсэн зарчмыг
          баримталж байна.
        </Text>

        <Text style={styles.textTitle}>
          Карьер гэдгийг та хэрхэн дүгнэдэг вэ?
        </Text>
        <Text style={styles.textStatus}>
          Хүн дуртай зүйлээ хийгээд, түүгээрээ мөнгө олдог зүйлийг карьер гэж би
          тодорхойлно.
        </Text>
        <Text style={styles.textStatus}>
          Карьер гэдэг бол мэргэжлийн тухай ойлголт огтхон ч биш. Бид тухайн
          нөхцөл байдал, тухайн насандаа тохируулаад өөрийгөө хөгжүүлээд авч
          явахыг карьер гэнэ гэж би ойлгож байна.
        </Text>
        <Text style={styles.textStatus}>
          Өнөөдрийн бидний амьдарч байгаа нийгэмд ердөө хурдацтай өөрчлөгдөж
          чаддаг ур чадвар л хэрэгтэй. Нөгөө талаар энтрепренер буюу бизнесмений
          сэтгэлгээтэй байх шаардлага тулгарч байна. Энэ нь бид эдийн засгийн
          хямрал, салбарын дампуурал нүүрлэсэн ч шинээр гарч ирж буй боломжуудыг
          эрж олж, бий болгож, шинэ салбар руу өөрийгөө хөрвүүлж чадах
          сэтгэлгээтэй байх ёстой гэсэн ойлголт юм.
        </Text>
        <Text style={styles.textStatus}>
          Тийм ч учраас би сүүлийн үеийн залууст бизнес сэтгэлгээтэй байж, старт
          ап гэж юу байдгийг ойлгоосой гэж маш их хүсдэг. Уламжлалт корпарац
          болон старт ап гэж байгаатай адил уламжлалт мэргэжлийн карьераас гадна
          бизнес сэтгэлгээтэй байх нь чухал.
        </Text>
        <Text style={styles.textStatus}>
          Би залуусыг энтрепренер , старт ап сэтгэлгээтэй болоосой гэж хүсдэг
          учраас TomYo-г хийхийн зэрэгцээ ном гаргасан. Одоогоор 10,000 орчим
          хувь борлуулаад байна.
        </Text>
        <Text style={styles.textStatus}>
          Энэ бол залуусыг илүү хөгжиж, өөрийнхөө хамгийн сайн хувилбараа
          бүтээгээсэй гэсэндээ хийж байгаа бас нэг зүйлийн маань нэг.
        </Text>
        <Image
          source={require("../../../assets/mag1/baykatalk.png")}
          style={{ width: windowWidth / 1.1, height: 180 }}
        />
        <Text
          style={{
            backgroundColor: "#fec214",
            textAlign: "center",
            fontFamily: "Montserrat-medium",
            paddingVertical: 10,
          }}
        >
          Бидний алсын хараа ердөө л Монгол оюуныг дэлхийд хүргэх зорилготой.
        </Text>
        <Text style={styles.textTitle}>
          Та өөрийн карьерынхаа туршид маш идэвхтэй ажиллаж, олон стартап үүсгэн
          байгуулсан. Энэ бүхнээс юуг хамгийн сайн ойлгож авсан бэ?
        </Text>
        <Text style={styles.textStatus}>
          Хүн ямар ч амжилт гаргаж, ямар ч ашигтай компани байгуулсан байсан
          эцсийн дүндээ тэр бүхэн нь нийгэмд ямар өөрчлөлтийг авчирч чадсан бэ
          гэдэг нь л чухал гэдгийг маш сайн ойлгосон.
        </Text>
        <Text style={styles.textStatus}>
          Тодруулбал, хүн өөрийнх нь хийсэн зүйл хэчнээн хүний амьдралд сайнаар
          нөлөөлж байгаагаас сэтгэл ханамж гэдэг зүйлийг утгаар нь мэдэрдэг юм
          билээ.
        </Text>
        <Text style={styles.textStatus}>
          ТomYo-г хийж байгаагийн зорилго ч нийгэмд маш том нөлөөлөл үзүүлнэ.
          Тиймээс би энэ ажлаасаа хамгийн их сэтгэл ханамж, баяр баяслыг мэдэрч
          байгаа. Ихэнх хүн ганцхан олдох амьдралаа утга учиртай өнгөрүүлэх
          хэрэгтэй гэж ярьцгаадаг. Харин миний хувьд, өнөөдрийг хүртэл хийсэн
          зүйл маань нийгэмд юуг бүтээж, юуг сайнаар өөрчилж чадсан бэ гэдгээ
          эргэж хараад дүгнэх нь тэр утга учиртай амьдарсны маань үндэс болно.
        </Text>
        <Text style={styles.textStatus}>
          Ямар ч сэтгэл ханамж богинохон цаг хугацааных. Жишээлбэл, Та шинэ
          машин авлаа гэхэд түүнээс авсан сэтгэл ханамж буюу кайф магадгүй
          долоохон хоног үргэлжилнэ.
        </Text>
        <Text style={styles.textStatus}>
          Долоо хоног эсвэл сарын дараа яг тэр машинаа шинээр авч байсан үеийн
          мэдрэмжээ дахиж авахгүй.
        </Text>
        <Text style={styles.textStatus}>
          Яг үүн шиг амьдралдаа бий болгосон сэтгэл ханамж утга учрыг
          илэрхийлнэ. Өөрөөр хэлбэл, хүн өөрийнхөө хийсэн ажлаар бусад хүний
          амьдралыг өөрчилж, нийгэмд сайн зүйл бий болгох нь өөрөө урт хугацааны
          сэтгэл ханамж буюу амьдралын тань утга учрыг тодорхойлох сэтгэл ханамж
          байх болно.
        </Text>
        <Text style={styles.textStatus}>
          Тиймээс эерэг нөлөөллийн мэдрэмж авч байгаа зүйлдээ илүү их цаг
          гаргаж, түүнийхээ төлөө ажиллах хэрэгтэй. Тэгж байж бид урт хугацааны
          сэтгэл ханамжтай амьдарна.
        </Text>
        <Text style={styles.textStatus}>
          Энэ хүртэл миний хамгийн их ойлгосон зүйл бол ердөө л энэ.
        </Text>
        <Text style={styles.textStatus}>
          Өөрт хэрэгтэй материаллаг зүйлийг бүтээхээс илүү урт хугацааны сэтгэл
          ханамжийг бий болгохын тулд эх орондоо болон бусдад хэрэгтэй зүйл хийх
          нь хамгийн чухал гэдгийг мэдэж авсан.
        </Text>
        <Text style={styles.textTitle}>
          Энэ бүгдээсээ залуу үедээ сургамж болгоод юу гэж хэлмээр байна..?
        </Text>
        <Text style={styles.textStatus}>
          Хэрвээ үнэхээр дургүй байвал ажлаа соль гэж би хэлэх дуртай. Түүний
          оронд өөрийнхөө дурлаж, хийхийг тэмүүлж буй зүйлээ олж мэд. Тийм ч
          амархан олдохгүй. Олохын тулд туршиж үзэх багахан хэмжээний зориг л
          гаргах хэрэгтэй. Үүнийг ойлгуулахын тулд залууст “Шууд ш**” гэж
          уриалдаг.
        </Text>
        <Text style={styles.textStatus}>
          Зүрх сэтгэлээ илүү сайн сонсож, үнэхээр хийе гэж бодогдсон зүйлээ
          зоригтойгоор шууд хийгээсэй гэж хүсдэг. Манайхан нэг зүйл эхлүүлмээр
          байвч тулгарах бэрхшээлээс нь айдаг. Эсвэл тулгарсан бэрхшээлээс болж
          дахиад жоохон гүрийчихье гээд л хүсэж байгаа зүйлээ хойшлуулаад байдаг
          нь буруу. Учир нь хүн хэзээ ч 25, эсвэл 20 насандаа эргээд очихгүй.
          Тиймээс залуу насанд чинь яг одоо олдож байгаа боломжуудыг үнэхээр
          тултал нь ашиглах хэрэгтэй.
        </Text>
        <Text style={styles.textStatus}>
          Нэг удаа мэргэжлээ буруу сонгосон эсвэл сонирхолгүй ажилд орсноо
          амьдралынхаа төгсгөл, сүйрэл мэт аашилхаа болиосой гэж чин сэтгэлээсээ
          хүсэж байна. Тиймээс их зоригтой үйлдэл хийдэг байгаарай гэж хэлье.
          Ялангуяа, Монгол шиг уян хатан нөхцөлтэй улсад залуус маань өөрийгөө л
          хөгжүүлсэн тохиолдолд хаана ч, хэзээ ч, ямар ч ажил хийх боломжтой.
        </Text>
        <Text style={styles.textStatus}>
          Тиймээс баригдмал байдлаас гарч, дургүй ажилтайгаа битгий зууралдаасай
          гэж боддог.
        </Text>
        <Text
          style={{
            backgroundColor: "#fec214",
            textAlign: "center",
            fontFamily: "Montserrat-bold",
            fontSize: 18,
            padding: 20,
          }}
        >
          Хэрвээ үнэхээр дургүй байвал ажлаа соль гэж би хэлэх дуртай. Түүний
          оронд өөрийнхөө дурлаж, хийхийг тэмүүлж буй зүйлээ олж мэд. Тийм ч
          амархан олдохгүй. Олохын тулд туршиж үзэх багахан хэмжээний зориг л
          гаргах хэрэгтэй. Үүнийг ойлгуулахын тулд залууст...
        </Text>
        <Text
          style={{
            color: "#fec214",
            fontFamily: "Montserrat-bold",
            fontSize: 30,
          }}
        >
          ШУУД Ш*А!{" "}
          <Text
            style={{
              color: "black",
              fontFamily: "Montserrat-bold",
              fontSize: 16,
            }}
          >
            ГЭЖ УРИАЛДАГ.
          </Text>
        </Text>
        <Text style={styles.textTitle}>
          Тэгвэл шинээр стартап үүсгэн байгуулж байгаа хүмүүст та юу гэж зөвлөх
          вэ?
        </Text>
        <Text style={styles.textStatus}>
          Хүн эхнийхээ оролдлогоор хэзээ ч амжилтад хүрдэггүй. Шинээр старт ап
          хийх гэж байгаа хүмүүст хандаж хэлэхэд, чи эхнийхээ оролдлогоор хэзээ
          ч амжилтад хүрэхгүй. Эхнийх дээрээ заавал алдана гэдгийг сануулъя.
          Гэхдээ эхний алхмаа хийхгүйгээр амжилт гэдэг зүйл хэзээ ч чамд
          ирэхгүй. Магадгүй дөнгөж сургуулиа төгссөн хүүхэд гадаадад сургуульд
          сурах гээд, эсвэл хүссэн ажилдаа орох гээд анкет бөглөхөд эхний
          оролдлогоор нь хэзээ ч бүтэхгүй. Гэхдээ эхний оролдлогоо огтхон ч
          хийгээгүй бол дөрөв эсвэл тав дахь оролдлого дээр чинь ирэх амжилтыг
          бодоод ч хэрэггүй.
        </Text>
        <Text style={styles.textStatus}>
          Оролдлогогүйгээр, алдахгүйгээр санасандаа хүрэх боломж хэзээ ч
          байдаггүй. Тиймээс асар өндөр хүлээлттэйгээр эхэлсэн ажил чинь, бизнес
          чинь бүтэхгүй бол өөрийгөө хохирогч гэж бодож, сэтгэлээр унах
          шаардлага огтхон ч байхгүй. Би ч ялгаагүй бүтэлгүйтэж байсан удаатай.
          Угаасаа эхний оролдлогоороо амжилтад хүрсэн хүн хаана ч байдаггүй.
        </Text>
        <Text style={styles.textStatus}>
          Дэлхийд нэртэй, мундаг хүмүүс ч эхний оролдлогоороо амжилт гаргаагүй.
          Гэхдээ тэднийг өнөөдрийн амжилтад хүрсний утга учир нь ердөө эхлүүлж
          чадсанд л байгаа юм.
        </Text>
        <Text style={styles.textStatus}>
          Эхний алхмаа хийгээд бүтэлгүйтэх нь нийт туулах ёстой замын чинь 30
          хувь нь гэж ойлгож болно. Гол нь эхлээгүй байгаа тохиолдолд чи хэзээ ч
          эцсийн цэгтээ хүрэхгүй гэдгийг маш сайн ойлгоорой. Тиймээс эхний
          оролдлогоороо мэдээж чи угаасаа бүтэлтэй байхгүй гэдгийг сануулъя.
        </Text>
        <Text style={styles.textStatus}>
          Бүтэлгүйт, гэхдээ дараагийн удаа хүчээ хуримтлуулж байгаад дахиад
          өөрөөр оролдоод үз гэж зөвлөе.
        </Text>
        <Image
          source={require("../../../assets/icon.png")}
          style={{
            width: 14,
            height: 14,
            alignSelf: "center",
            bottom: 25,
            left: 25,
          }}
        />
      </View>
      <Text
        style={{
          fontSize: 14,
          fontFamily: "Montserrat-bold",
          marginHorizontal: 20,
          marginVertical: 30,
          textAlign: "right",
        }}
      >
        2022/03 САР
      </Text>
    </ScrollView>
  );
};

export default Page3;

const styles = StyleSheet.create({
  textTitle: {
    fontSize: 18,
    fontFamily: "Montserrat-bold",
    marginVertical: 8,

    // marginBottom: 15,
    // textAlign: "justify",
  },
  textStatus: {
    fontSize: 16,
    fontFamily: "Montserrat-regular",
    // textAlign: "justify",
    marginVertical: 8,
  },
});
